redditClone/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    # debugger
    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    @user = User.find_by_id(params[:id])
    if @user && @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "bobby"], ["password_digest", "$2a$12$B9KL3rPap0cPEmpZLxL2d.eNztZRv4eMaSXouTctSQNZKV2iSrGG6"], ["updated_at", "2021-02-15 22:44:08.111093"], ["id", 1]]